{
  "self introduction": "👋 Hello! I'm Ajay Babu, a passionate BTech student specializing in full-stack development and AI projects.",
  "project ideas": "🚀 Project Ideas:\n- AI Resume Screening Tool\n- Virtual Health Assistant\n- Smart Chatbot\n- Real-time Weather App",
  "contact": "📧 Email: ajay@example.com\n📞 Phone: +91 1234567890",
  "backend concepts": "Backend is the server-side code that handles data, business logic, database interaction, and API responses.",
  "frontend concepts": "Frontend is what users see and interact with, built with HTML, CSS, and JavaScript.",
  "btech syllabus": "BTech syllabus usually includes subjects like Data Structures, Algorithms, DBMS, Operating Systems, Networks, AI, Machine Learning, and Software Engineering.",
  "study tips": "📚 Study Tips:\n1. Make a schedule\n2. Practice coding daily\n3. Join study groups\n4. Solve previous year question papers\n5. Take breaks and stay healthy",
  "exam preparation": "Focus on understanding concepts, practice problems, and revise important topics regularly. Use mock tests to improve time management.",
  "career advice": "Choose a field you are passionate about. Keep learning new technologies, build projects, and participate in internships.",
  "internship tips": "Start applying early, prepare a good resume, practice interviews, and build a portfolio of projects.",
  "coding languages": "Popular coding languages include Python, Java, C++, JavaScript, and SQL.",
  "database basics": "Databases store data in structured formats. Types include relational (MySQL, PostgreSQL) and NoSQL (MongoDB).",
  "express js": "Express is a minimal and flexible Node.js web application framework that provides robust features for web and mobile applications.",
  "node js": "Node.js is a JavaScript runtime built on Chrome's V8 engine, allowing you to run JS code outside the browser.",
  "http methods": "Common HTTP methods are GET (read), POST (create), PUT (update), DELETE (remove).",
  "rest api": "REST API is a web service that uses HTTP requests to GET, PUT, POST and DELETE data.",
  "git basics": "Git is a version control system to track changes in code. Use commands like git init, git add, git commit, git push.",
  "github": "GitHub is a web-based platform to host and review code, manage projects, and collaborate.",
  "linux commands": "Basic Linux commands include ls, cd, mkdir, rm, cp, mv, and pwd.",
  "data structures": "Data structures organize data. Examples are arrays, linked lists, stacks, queues, trees, and graphs.",
  "algorithms": "Algorithms are step-by-step procedures to solve problems, like sorting and searching.",
  "machine learning": "Machine Learning is a subset of AI that allows computers to learn from data and make predictions.",
  "artificial intelligence": "AI is the simulation of human intelligence by machines to perform tasks.",
  "cloud computing": "Cloud computing delivers computing services over the internet, such as storage and servers.",
  "software engineering": "It is the discipline of designing, developing, and maintaining software systems.",
  "operating systems": "Operating systems manage hardware and software resources. Examples: Windows, Linux, macOS.",
  "networking basics": "Networking connects computers to share data and resources. Protocols include TCP/IP, HTTP, FTP.",
  "web development": "Web development involves creating websites and web applications using HTML, CSS, JavaScript, and backend tech.",
  "programming best practices": "Write clean, readable code. Use comments. Follow DRY (Don't Repeat Yourself) and KISS (Keep It Simple) principles.",
  "debugging tips": "Use debugging tools, read error messages carefully, isolate the problem, and test fixes incrementally.",
  "soft skills": "Communication, teamwork, problem-solving, time management, and adaptability are key soft skills.",
  "resume tips": "Highlight skills, projects, internships, and achievements clearly. Tailor your resume to the job.",
  "interview preparation": "Practice coding problems, understand basics, prepare for behavioral questions, and mock interviews.",
  "job search": "Use job portals, networking, internships, and referrals to find job opportunities.",
  "online learning platforms": "Popular platforms: Coursera, Udemy, edX, Khan Academy, freeCodeCamp.",
  "project management": "Project management involves planning, executing, and closing projects efficiently.",
  "agile methodology": "Agile is an iterative approach to software development emphasizing collaboration and flexibility.",
  "api": "API (Application Programming Interface) allows communication between software components.",
  "security basics": "Understand authentication, authorization, encryption, and common vulnerabilities.",
  "code versioning": "Keep track of code changes using tools like Git to collaborate effectively.",
  "deployment": "Deployment is publishing your app to the web, using services like Heroku, Netlify, or AWS.",
  "testing": "Testing ensures code works as expected; includes unit testing, integration testing, and system testing."
}
